Revit 2027 API
ContinuousRail.Length Property
 The length of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Length { get; }
Public ReadOnly Property Length As Double
	Get
public:
property double Length {
	double get ();
}
member Length : float with get
Property Value
Double
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace